import json

import pytest

from src.services import cashback_analyze


@pytest.mark.parametrize(
    "data, year, month, expected",
    [
        (
            # Пример с обычными данными
            [
                {"Дата операции": "10.03.2025 12:30:00", "Категория": "Категория 1", "Сумма операции": 500},
                {"Дата операции": "10.03.2025 13:30:00", "Категория": "Категория 1", "Сумма операции": 1000},
                {"Дата операции": "10.03.2025 14:30:00", "Категория": "Категория 2", "Сумма операции": 700},
            ],
            2025,
            3,
            {"Категория 1": 15.0, "Категория 2": 7.0},
        ),
        (
            # Пример с пустыми данными
            [],
            2025,
            3,
            {},
        ),
        (
            # Пример с отрицательными суммами
            [
                {"Дата операции": "10.03.2025 12:30:00", "Категория": "Категория 1", "Сумма операции": -500},
                {"Дата операции": "10.03.2025 13:30:00", "Категория": "Категория 1", "Сумма операции": -1000},
                {"Дата операции": "10.03.2025 14:30:00", "Категория": "Категория 2", "Сумма операции": -700},
            ],
            2025,
            3,
            {"Категория 1": 15.0, "Категория 2": 7.0},
        ),
    ],
)
def test_calculate_cashback(data: list, year: int, month: int, expected: dict[str, float]) -> None:
    result = cashback_analyze(data, year, month)

    result_dict = json.loads(result)

    if not expected:
        assert result_dict == expected
    else:
        assert result_dict == expected
